Lang = {}

Lang.Coke = {
    -- شريط تقدم العميل
    picking = "جمع الأوراق",
    makepow = 'تقطيع الأوراق إلى مسحوق',
    -- نهاية شريط التقدم
    cut = "قمت بتقطيع بعض الكوكا",
    nocutcoke = "لا يمكنك تقطيع الكوكا بدونها، أحمق",
    bagcoke = "لقد قمت بتعبئة الكوكا",
    nobagcoke = "لا يمكنك تعبئة الكوكا بدونها، أحمق",
}
Lang.Crack = {
    -- العميل
    cookcrack = "طهي الكراك",
    bagcrack = 'تعبئة هذا',
    -- الخادم
    makecrack = 'كراك جيد',
    nocoke = 'لا يمكنك صنع هذا بدون الكوكا'
}
Lang.Cornerselling = {
    -- إشعارات العميل
    toofar = "بعيد جدًا عن زاويتك، صديقي",
    inacar = "لا يمكنك البيع أثناء الجلوس في السيارة",
    deny = "إلى الجحيم بهذا العرض",
    start = "احصل على تلك الأموال",
    stop = "لا يمكن للشخص الكسول حتى بيع المخدرات",
    nodrugs = "ماذا ستبيع؟ هواء؟",
    notcops = "لا يوجد عدد كاف من رجال الشرطة",
    -- نهاية إشعارات العميل
    -- شريط التقدم
    sell = "بيع المخدرات",
}
Lang.Delivery = {
    -- العميل
    search = "البحث عن توصيل ...",
    none = "لا شيء قريب",
    busy = "لم تنه أيضًا الذي قلت لك أن تنهيه",
    found = "محدد على خريطتك",
    already = "بالفعل توصيل",
    checkrep = "سمعة البائع الحالية: ",
    -- شريط التقدم
    pack = 'تسليم الحزمة',
    -- نهاية العميل
}
Lang.Heroin = {
    -- العميل
    pick = "جمع الأفيون",
    tableout = 'لديك بالفعل طاولة معدة',
    dryout = "تجفيف الأفيون",
    cutting = "تقطيع الهيروين مع الصودا الخبز",
    secret = "ششششش",
    table = "وضع الطاولة",
    success = "تسخين الهيروين بشكل جيد",
    clean = 'تنظيف طاولة الهيروين',
    needles = 'ملء الحقنة',
    -- تعيين سيناريو الشخصيات المتوقع إرجاعها بالأمر التالي
    cutheroin = 'قمت بتحضير بعض الهيروين المقطوع',
    noheroin = "كيف يمكنك تقطيع الهيروين بدونه، أحمق",
    vial = 'قمت بصنع قارورة هيروين',
    novial = "كيف يمكنك صنع قوارير هيروين بدونه، أحمق",
    fail = 'لقد سخنتهم كثيرًا، أحمق',
    fill = 'تم ملء الحقنة',
    nofill = 'كيف ستملأ الإبر بالهيروين بدونه'
}
Lang.Lean = {
    marked = 'تم وضع علامة على السيارة على خريطتك',
    lean = 'لقد حصلت على Lean الأرجواني',
    dextro = 'لقد حصلت على ديكسترو أحمر'
}

Lang.lsd = {
    steallys = 'سرقة حمض الليزرجيك',
    stealdie = 'سرقة حمض الليزرجيك',
    tableout = 'لديك بالفعل طاولة معدة',
    tablepack = 'تعبئة الطاولة',
    heat = 'تسخين السوائل',
    clean = 'تنظيف الطاولة',
    refine = 'تنقية الجودة',
    dip = 'تغميس حمض الليزرجيك في الورق',
    buypaper = 'شراء ورق التبن',
    buykit = 'شراء مجموعة مختبر',
    -- الخادم
    lys = 'لقد حصلت على حمض الليزرجيك',
    die = 'لقد حصلت على الديثيلاميد',
    cleaned = 'لقد قمت بتنظيفه بشكل مثالي',
    madelsd = 'لقد صنعت الإل إس دي!',
    failed = 'لقد سخنتهم كثيرًا، أحمق',
    refined = 'لقد قمت بتنقيتهم!',
    broke = 'لا يمكنك تحمل هذا الآن!',
    novial = 'لا يوجد قوارير إل إس دي، أحمق',
}
Lang.mescaline = {
    pick = "جمع الصبار",
    dry = 'تجفيف الصبار',
    nocactus = 'لا توجد بصيلات صبار'
}

Lang.meth = {
    inside = 'يوجد بالفعل شيء في الداخل',
    increaseheat = 'زيادة الحرارة',
    mission = 'تم وضع علامة على السيارة على خريطتك',
    ace = 'لقد حصلت على بعض الأستون',
    eph = 'لقد حصلت على بعض الإيفيدرين',
    mix = 'إضافة أشياء إلى الخليط',
    nobag = 'لا توجد حقائب'
}

Lang.oxy = {
    truck = 'سيارتك هنا',
    cantcarry = 'أنت لست قويًا لهذا، يمكنك حمل واحد فقط',
    hand = 'تسليم الأكسيجين',
    empty = 'لا يمكنك أن تكون بلا شيء في يدك، أحمق',
    broke = 'لا يمكنك تحمل هذا المبلغ!',
    hot = 'السيارة ساخنة، ارمها الآن',
    next = 'انتقل إلى الموقع التالي'
}

Lang.Pharma = {
    notems = 'أنت لست شخصًا طبيًا',
    write = 'كتابة الوصفة الطبية',
    fill = 'ملء الوصفة الطبية',
    open = 'فتح الزجاجة',
    pills = 'لقد حصلت على بعض الحبوب!',
    no = 'ليس لديك وصفة طبية'
}

Lang.Shrooms = {
    pick = 'جمع الفطر',
    eat = 'أكل الفطر',
    trip = 'رحلة ممتعة!'
}

Lang.Weed = {
    pick = 'حصاد الحشيش',
    busy = 'بالفعل تجفيف واحد',
    canna = 'صنع زبدة الكانابينويد',
    brown = 'صنع براونيز خاصة',
    cook = 'صنع كوكيز خاصة',
    Choc = 'صنع شوكولاتة خاصة',
    muff = 'صنع مافن خاصة',
    stovehot = 'الموقد ساخن جدًا، انتظر 30 ثانية ليبرد',
    shat = 'صنع شاتر',
    roll = 'لف السجائر',
    -- 
    nodry = 'تحتاج إلى حشيش رطب لتجفيفه',
    noweed = 'لا يمكنك لف السجائر بالهواء',
    noshat = 'تحتاج إلى شاتر للقيام بـ Dab',
    notorch = 'تحتاج إلى شعلة بوتان'
}

Lang.xtc = {
    out = 'لديك بالفعل ماكينة برس جاهزة',
    pressing = 'ضغط الحبوب',
    raw = 'صنع XTC خام',
    mdp2p = 'سرقة MDP2P',
    iso = 'سرقة إيزوسافرول',
    fail = 'رفيق، إنه دائرة ليست علم صواريخ',
    --
    cash = 'أحتاج 20 ألف نقدًا'
}
